In [1]:
import pandas as pd
import numpy as  np

## Read the csv or excel file.

In [2]:
df = pd.read_csv(r"used_bikes.csv")
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000,Ahmedabad,17654,First Owner,3,110,TVS
1,Royal Enfield Classic 350cc,119900,Delhi,11000,First Owner,4,350,Royal Enfield
2,Triumph Daytona 675R,600000,Delhi,110,First Owner,8,675,Triumph
3,TVS Apache RTR 180cc,65000,Bangalore,16329,First Owner,4,180,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000,Bangalore,10000,First Owner,3,150,Yamaha

## Change the datatypes of the column and check the memory usage before and after the change in the data types.

In [3]:
df.columns

Index(['bike_name', 'price', 'city', 'kms_driven', 'owner', 'age', 'power',
       'brand'],
      dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int64
 4   owner       149 non-null    object
 5   age         149 non-null    int64
 6   power       149 non-null    int64
 7   brand       149 non-null    object
dtypes: int64(4), object(4)
memory usage: 9.4+ KB

## Initial Memory Usage

In [5]:
print("Memory usage before changing datatypes:", df.memory_usage().sum() / (1024 ** 2), "MB")

Memory usage before changing datatypes: 0.00921630859375 MB

In [6]:
num_columns = list(df[df.columns].select_dtypes(include=['int64']).columns)
num_columns

['price', 'kms_driven', 'age', 'power']

In [7]:
df[['price', 'kms_driven', 'age', 'power']] = df[['price', 'kms_driven', 'age', 'power']].astype('float32')
df.info()
#also tried changing dtype to int32, both were having the same reduced memory

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    object
 5   age         149 non-null    float32
 6   power       149 non-null    float32
 7   brand       149 non-null    object
dtypes: float32(4), object(4)
memory usage: 7.1+ KB

## Reduced Memory Usage

In [8]:
print("Memory usage before changing datatypes:", df.memory_usage().sum() / (1024 ** 2), "MB")

Memory usage before changing datatypes: 0.0069427490234375 MB

## Dumping the dataset into database

In [9]:
from sqlalchemy import create_engine

# Connecting to the database
engine = create_engine('mysql+mysqlconnector://root:9451@localhost/bikes')

# Insert data into the table
df.to_sql(name='bike', con=engine, if_exists='replace')

## 4. indexing the column after dataframe is inserted into the database

In [10]:
from sqlalchemy import create_engine

# Connect to the database
engine = create_engine('mysql+mysqlconnector://root:9451@localhost/bikes')

# drop the index 
engine.execute("ALTER TABLE bike DROP INDEX index")

# Insert data into the table with specific columns
df[['bike_name', 'price', 'city', 'kms_driven', 'owner', 'age', 'power', 'brand']].to_sql(name='bike', con=engine, if_exists='replace')

# choose the column 'kms_driven' as index
engine.execute("ALTER TABLE bike ADD INDEX (kms_driven)")

print("Success")

Success

Visit the python task.sql file to see the database and its rows